app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @game = Game.find params[:id]